### Setting Up Environment 
Connecting to database

In [3]:
# Import the necessary libraries
import sqlite3
import pandas as pd

# Setting up the database. DO NOT edit the code given below
conn = sqlite3.connect('./database/production3.db')

#### Test Query

In [4]:
query = ''' 
SELECT * 
FROM cheese_production 
LIMIT 5'''
result = pd.read_sql(query, conn)
display(result)

   Year Period Geo_Level  State_ANSI  Commodity_ID Domain      Value
0  2023    APR     STATE           6             6  TOTAL  208807000
1  2023    APR     STATE          16             6  TOTAL   86452000
2  2023    APR     STATE          17             6  TOTAL    5068000
3  2023    APR     STATE          19             6  TOTAL   31512000
4  2023    APR     STATE          27             6  TOTAL   69728000

### Analysis Begin

Find the total milk production for the year 2023.

In [12]:
query = ''' 
SELECT SUM(Value) 
FROM milk_production 
WHERE Year = 2023;
'''
result = pd.read_sql(query, conn)
display(result)

    SUM(Value)
0  91812000000

Find the average honey production for the year 2022.

In [11]:
query = ''' 
SELECT AVG(Value) 
FROM honey_production 
WHERE Year = 2022
'''
result = pd.read_sql(query, conn)
display(result)

   AVG(Value)
0   3133275.0

What number is Iowa?

In [6]:
query = '''
SELECT * 
FROM state_lookup
WHERE State = 'IOWA'
'''
result = pd.read_sql(query, conn)
display(result)

  State  State_ANSI
0  IOWA          19

Find states where both honey and milk were produced in 2022.

In [8]:
query = '''
SELECT DISTINCT h.State_ANSI FROM honey_production h
JOIN milk_production m ON h.State_ANSI = m.State_ANSI
WHERE h.Year = 2022 AND m.Year = 2022
'''
result = pd.read_sql(query, conn)
display(result)

    State_ANSI
0            1
1            4
2            5
3            6
4            8
5           12
6           13
7           16
8           17
9           18
10          19
11          20
12          21
13          22
14          23
15          26
16          27
17          28
18          29
19          30
20          31
21          34
22          36
23          37
24          38
25          39
26          41
27          42
28          45
29          46
30          47
31          48
32          49
33          50
34          51
35          53
36          54
37          55
38          56

Find the total yogurt production for states that also produced cheese in 2022.

In [9]:
query = '''
SELECT SUM(y.Value)
FROM yogurt_production y
WHERE y.Year = 2022 AND y.State_ANSI IN (
    SELECT DISTINCT c.State_ANSI FROM cheese_production c WHERE c.Year = 2022
);
'''
result = pd.read_sql(query, conn)
display(result)

   SUM(y.Value)
0    1171095000

### Close the Connection

In [16]:
# Close the database connection 
conn.close()